[
    {
        "id": 1,
        "text": "This is a sample encounter demonstrating how a basic encounter in D&D might work.",
        "options": [
            {
                "text": "Next",
                "nextText": 2,
                "requiredState": null
            }
        ]
    },
    {
        "id": 2,
        "text": "You are Bob, a level 1 human fighter. \n You have a handaxe, a shield, and 100 gold.",
        "options": [
            {
                "text": "Next",
                "nextText": 3,
                "requiredState": null
            }
        ]
    },
    {
        "id": 3,
        "text": "Your party currently resides in a small village half a mile back. You've been tasked to go get food from a town a few miles up the road.",
        "options": [
            {
                "text": "Next",
                "nextText": 4,
                "requiredState": null
            }
        ]
    },
    {
        "id": 4,
        "text": "Suddenly, a small figure darts in front of your path, startling you slightly. It's a goblin, a rather small one. A brown, disheveled robe covered most of his body. \"Gimme all yer gold, or you'll be sorry!\" He threatens while somewhat shakily pointing a dagger at you. The dagger appears to be made out of some sort of sharpened bone.",
        "options": [
            {
                "text": "Bargain with him (Persuasion check)",
                "nextText": 5,
                "requiredState": null,
                "skillCheck": {
                    "threshold": 8,
                    "successNextText": 6,
                    "failureNextText": 7
                }
            },
            {
                "text": "Intimidate him (Intimidation check)",
                "nextText": 5,
                "requiredState": null,
                "skillCheck": {
                    "threshold": 13,
                    "successNextText": 8,
                    "failureNextText": 9
                }
            },
            {
                "text": "Trick him into a ploy (Deception check)",
                "nextText": 5,
                "requiredState": null,
                "skillCheck": {
                    "threshold": 15,
                    "successNextText": 10,
                    "failureNextText": 11
                }
            }
        ]
    },
    {
        "id": 5,
        "text": "The goblin reacts to your action.",
        "options": [
            {
                "text": "Next",
                "nextText": 8,
                "requiredState": null
            }
        ]
    },
    {
        "id": 6,
        "text": "You rolled a [roll]. Persuasion check was successful!",
        "options": [
            {
                "text": "Next",
                "nextText": 12,
                "requiredState": null
            }
        ]
    },
    {
        "id": 7,
        "text": "You rolled a [roll]. Persuasion check failed!",
        "options": [
            {
                "text": "Next",
                "nextText": 21,
                "requiredState": null
            }
        ]
    },
    {
        "id": 8,
        "text": "You rolled a [roll]. Intimidation check was successful!",
        "options": [
            {
                "text": "Next",
                "nextText": 50,
                "requiredState": null
            }
        ]
    },
    {
        "id": 9,
        "text": "You rolled a [roll]. Intimidation check failed!",
        "options": [
            {
                "text": "Next",
                "nextText": 57,
                "requiredState": null
            }
        ]
    },
    {
        "id": 10,
        "text": "You rolled a [roll]. Deception check was successful!",
        "options": [
            {
                "text": "Next",
                "nextText": 75,
                "requiredState": null
            }
        ]
    },
    {
        "id": 11,
        "text": "You rolled a [roll]. Deception check failed!",
        "options": [
            {
                "text": "Next",
                "nextText": 85,
                "requiredState": null
            }
        ]
    },
    {
        "id": 8,
        "text": "The encounter concludes.",
        "options": []
    },
    {
        "id": 12,
        "text": "You relax your stance a bit. It's obvious to you that this goblin is a little uneasy doing this highway robbery, so perhaps you two could reach a compromise.\n \"Now hold on, noone needs to get hurt over some gold pieces\" you begin, \"but I need this gold to buy food for my party in the town up ahead. They're counting on me.\"",
        "options": [
            {
                "text": "Next",
                "nextText": 13,
                "requiredState": null
            }
        ]
    },
    {
        "id": 13,
        "text": "\"I doubt I'll be spending all the gold today though. I think I could spare you 25gp.\"\n The goblin stops for a moment to consider your offer. \"Hmmmmm.. 35gp and you got yer deal.\"",
        "options": [
            {
                "text": "Accept offer",
                "nextText": 14,
                "requiredState": null
            },
            {
                "text": "Decline offer (Persuasion check)",
                "nextText": 8,
                "requiredState": null,
                "skillCheck": {
                    "threshold": 12,
                    "successNextText": 16,
                    "failureNextText": 17
                }
            }
        ]
    },
    {
        "id": 14,
        "text": "You decide not to push your luck. Going to bed with a full stomach sounds great, but not getting stabbed sounds even better.\n \"Fine, one moment if you would.\" You open up your pouch and openly count out 35gp before dropping the count into the goblins cuped palm.\n \"Ehehehe, pleasure doin business with yeh.\" The goblin chuckled as he disappeared into the thick vegetation from which he had so suddenly appeared.",
        "options": [
            {
                "text": "Next",
                "nextText": 15,
                "requiredState": null
            }
        ]
    },
    {
        "id": 15,
        "text": "You sigh, loosing 35% of your funds before you had even made it into town wasn't ideal, but you still had some gold left, as well as all your blood. You continue on your path, a little more aware of your surroundings this time...",
        "options": [
        ]
    },
    {
        "id": 16,
        "text": "You rolled a [roll]. Persuasion check was successful!",
        "options": [
            {
                "text": "Next",
                "nextText": 19,
                "requiredState": null
            }
        ]
    },
    {
        "id": 17,
        "text": "You rolled a [roll]. Persuasion check failed!",
        "options": [
            {
                "text": "Next",
                "nextText": 18,
                "requiredState": null
            }
        ]
    },
    {
        "id": 18,
        "text": "You decide to stand firm with your original offer. \"Sorry, but 25gp is my only offer. Like I said, I have others counting on me.\" \nThe goblin's face twisted in frustration. \"Well...\" he started after a few moments \"... it's a shame we couldn't come to an agreement.\" He quickly composes himself before assuming a combat stance. It seems that combat is inevitable...",
        "options": [
            {
                "text": "Next",
                "nextText": 100,
                "requiredState": null
            }
        ]
    },
    {
        "id": 19,
        "text": "You decide to stand firm with your original offer. \"Sorry, but 25gp is my only offer. Like I said, I have others counting on me.\" \nThe goblin's face twisted in frustration. \"Grrrrr fine!\" He exclaimed after a few moments \"25gp. No less.\" \nYou open up your pouch and openly count out 25gp before dropping the count into the goblin's cuped palm.\n \"Yer lucky you caught me on a good day.\" He grumbles as he disappears into the thick vegetation from which he had so suddenly appeared.",
        "options": [
            {
                "text": "Next",
                "nextText": 20,
                "requiredState": null
            }
        ]
    },
    {
        "id": 20,
        "text": "You continue towards your destination. Despite loosing a fourth of your wealth, you can't help but feel proud of the fact you talked a thief out of robbing you blind by simply explaining your situation.\n Despite your pride, you are certainly more aware of your surroundings now...",
        "options": [
        ]
    },
    {
        "id": 21,
        "text": "You relax your stance a bit. It's obvious to you that this goblin is a little uneasy doing this highway robbery, so perhaps you two could reach a compromise.\n \"Now hold on, noone needs to get hurt over some gold pieces\" you begin, \"but I-\"",
        "options": [
            {
                "text": "Next",
                "nextText": 22,
                "requiredState": null
            }
        ]
    },
    {
        "id": 22,
        "text": "\"Yer right about that,\" the goblin cuts in, \"so drop yer gold pouch!\" He assumes an aggressive stance. It seems that combat is inevitable...",
        "options": [
            {
                "text": "Next",
                "nextText": 100,
                "requiredState": null
            }
        ]
    },
    {
        "id": 50,
        "text": "It's obvious to you that this goblin is pretty nervous about preforming a hold up like this. You know you could take advantage of this, and you already have a gambit in mind.",
        "options": [
            {
                "text": "Next",
                "nextText": 51,
                "requiredState": null
            }
        ]
    },
    {
        "id": 51,
        "text": "You have had gripes with your upbringing. Being the son of two talented magic users meant hours upon hours of reading old tomes and writing research papers on histories most influential wizards, magicians, and the like. Not only did you find it all to be very boring and uninteresting, you found that a lot of what magic could do, ordinary people could do as well. Why conjure a fireball when a flaming arrow would do the trick?",
        "options": [
            {
                "text": "Next",
                "nextText": 52,
                "requiredState": null
            }
        ]
    },
    {
        "id": 52,
        "text": "You went adventuring as a fighter to prove that you don't need magic to achieve greatness, to prove that you could get the job done without the spectacle. That same spectacle, however, is what you must rely on now.",
        "options": [
            {
                "text": "Next",
                "nextText": 53,
                "requiredState": null
            }
        ]
    },
    {
        "id": 53,
        "text": "You step forward, keeping your eyes locked on the thief. Just before reaching striking distance, you hold your axe out in front of you, muttering a short incantation under your breath...",
        "options": [
            {
                "text": "...",
                "nextText": 54,
                "requiredState": null
            }
        ]
    },
    {
        "id": 54,
        "text": "Your axe suddenly bursts into flames, as if you were holding a bonfire on a stick! \"w-w-WHHHHAAAAAA!! Y-YER A DEMON!!!\" the goblin whips around and bolts back into the vegetation from where he first appeared, dropping his dagger in the process.",
        "options": [
            {
                "text": "Next",
                "nextText": 55,
                "requiredState": null
            }
        ]
    },
    {
        "id": 55,
        "text": "You stand there for a couple seconds before reflexively dropping the now very hot handle of your hand axe. The charred handle snapps in half when it hits the ground. You sigh in relief, thankful that your bluff worked. Magic isn't good for much, but when it comes to putting on a show, it's unparalleled.",
        "options": [
            {
                "text": "Next",
                "nextText": 56,
                "requiredState": null
            }
        ]
    },
    {
        "id": 56,
        "text": "You pick up the dagger the goblin dropped. It's good that you got another weapon considering your previous one is currently a smoldering axe head in a pile of ash. You continue on your path, a little more aware of your surroundings this time...",
        "options": [
        ]
    },
    {
        "id": 57,
        "text": "It's obvious to you that this goblin is pretty nervous about preforming a hold up like this. You know you could take advantage of this, but you don't have an immediate plan. You think for a moment about what to say before you reflexively block a slice from the goblin's dagger with your shield. He has made up his mind before you have. It seems that combat is inevitable...",
        "options": [
            {
                "text": "Next",
                "nextText": 100,
                "requiredState": null
            }
        ]
    },
    {
        "id": 75,
        "text": "The nervous disposition of goblin sticking you up made it obvious that he had to rob you, despite not wanting to. A small grin appears on your face. Maybe you could have a little fun with this.",
        "options": [
            {
                "text": "Next",
                "nextText": 77,
                "requiredState": null
            }
        ]
    },
    {
        "id": 77,
        "text": "\"Highway robbery, huh? I can respect the grind as a fellow thief\" you respond to the goblin. \"Eh? You don't look like a theif.\" While it's true you had sticky fingers as a kid, you were a long way from calling yourself a proper theif. That didn't stop you from selling yourself as one. \"All the better I don't look like one, don't you think? Anyway, I think I have an idea that could leave both of us with heavy pockets.\" you show the goblin a mischievous smile \"A two man job...\"",
        "options": [
            {
                "text": "Next",
                "nextText": 78,
                "requiredState": null
            }
        ]
    },
    {
        "id": 78,
        "text": "...",
        "options": [
            {
                "text": "...",
                "nextText": 79,
                "requiredState": null
            }
        ]
    },
    {
        "id": 79,
        "text": "You're crouched down next to the same goblin that tried to rob you not an hour previous. You are both hidden in a bush close to your party's campsite. \"We're gonna rob these guys? They don't look very rich.\" \"They were boasting about a successful dungeon raid when I passed through, saying they don't need to work a day in their lives because of their haul. They should have their earnings in that tent over there.\"",
        "options": [
            {
                "text": "Next",
                "nextText": 80,
                "requiredState": null
            }
        ]
    },
    {
        "id": 80,
        "text": "You're lying through your teeth. most of the wealth your party had was stashed away in your gold pouch. You just needed the goblin to step in the tent, if only for a moment. \"I'll go distract them now, hurry to the tent.\"",
        "options": [
            {
                "text": "Next",
                "nextText": 81,
                "requiredState": null
            }
        ]
    },
    {
        "id": 81,
        "text": "Your arrival back at camp so soon caused confusion among the party. You brush off your party's questions until you see the goblin slip into the tent. Perfect.",
        "options": [
            {
                "text": "Next",
                "nextText": 82,
                "requiredState": null
            }
        ]
    },
    {
        "id": 82,
        "text": "The mischievous smile returns to your face. \"Actually, I met a friend on my way to town, and I'd like you all to meet him. He's in our tent right now...\"",
        "options": [
            {
                "text": "Next",
                "nextText": 83,
                "requiredState": null
            }
        ]
    },
    {
        "id": 83,
        "text": "...",
        "options": [
            {
                "text": "...",
                "nextText": 84,
                "requiredState": null
            }
        ]
    },
    {
        "id": 84,
        "text": "The goblin didn't stand a chance while surrounded by your party and trapped in your tent. You feel a little bad that it was so easy to trick him just by promising gold, but that's what he gets for being naïve. You also got 34gp and a cool dagger for your trouble! You continue on your path, a little more aware of your surroundings this time...",
        "options": [
        ]
    },
    {
        "id": 85,
        "text": "\"Wait-\" you begin, \"you're robbing the wrong guy! I only have 20gp on me. However-\" \" I don't care how much you got, whatever it is, it's mine!\" The goblin cuts you off, assuming a combat stance. If the goblin wasn't sure about attacking you before, he sure is now. It seems that combat is inevitable...",
        "options": [
            {
                "text": "Next",
                "nextText": 100,
                "requiredState": null
            }
        ]
    },
    {
        "id": 100,
        "text": "Combat rages on...",
        "options": [
            {
                "text": "Attack the goblin!",
                "nextText": 101,
                "requiredState": null
            },
            {
                "text": "Run away!",
                "nextText": 102,
                "requiredState": null
            }
        ]
    },
    {
        "id": 101,
        "text": "You attack the goblin!",
        "options": [
            {
                "text": "Next",
                "nextText": 103,
                "requiredState": null
            }
        ]
    },
    {
        "id": 102,
        "text": "Though its embarrassing, you decide you have to make your escape. As you turn to run away, the goblin's dagger catches your gold pouch and tears it open, spilling most of its contents onto the road. You keep on running despite this. You check your inventory once you've made sufficient distance. Once you do that you continue your way back to camp, you have to explain to your party why you lost 59gp and don't have food...",
        "options": []
    },
    {
        "id": 103,
        "text": "Player deals [playerDamage] damage to the goblin. Goblin HP: [goblinHP]",
        "options": [
            {
                "text": "Next",
                "nextText": 104,
                "requiredState": null
            }
        ]
    },
    {
        "id": 104,
        "text": "Goblin deals [goblinDamage] damage to you. Player HP: [playerHP]",
        "options": [
            {
                "text": "Next",
                "nextText": 100,
                "requiredState": null
            }
        ]
    },
    {
        "id": 105,
        "text": "Your last attack sealed it. \"AIYEEE!\" The goblin whips around and dashes toward the vegetation from where he first appeared. \"You'll pay for this!\" he screeches as he disappears. You didn't want it to come to this, but at least you got out with only a few scratches. You continue on your path, a little more aware of your surroundings this time...",
        "options": []
    },
    {
        "id": 106,
        "text": "This goblin is much better at fighting than you first thought. Though its embarrassing, you have to make your escape. As you turn to run away, the goblin's dagger catches your gold pouch and tears it open, spilling most of its contents onto the road. You keep on running despite this. You check your inventory once you've made sufficient distance. Once you do that you continue your way back to camp, you have to explain to your party why you lost 73gp and don't have food...",
        "options": []
    }
]
